# FaceWallBadType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..FaceWallBadType Property
BuiltInFailures..::..WallFailures Class See Also
---
Wall type '[Type Name]' is incompatible with picked face. Only basic wall types are accepted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FaceWallBadType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceWallBadType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FaceWallBadType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace